Repository: maddie-crowne/CS_2340_team19P2
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fr

source: Account Details
es: Detalles de la cuenta
fr: Détails du compte

source: Contact Us
es: Contacta con nosotras
fr: Contactez-nous

source: Invite
es: Invitar
fr: Inviter

source: Saved Wraps
es: Wraps guardados
fr: Wraps enregistrés

source: Monthly Wrap
es: Wrap mensual
fr: Wrap mensuel

source: 6 Month Wrap
es: 6 meses Wrap
fr: 6 mois de Wrap

source: Yearly Wrap
es: Wrap anual
fr: Wrap annuel

source: Are you sure you want to unsave this wrap?
es: ¿Estás seguro que deseas eliminar este wrap?
fr: Etes-vous sûr de vouloir supprimer ce wrap ?

source: Delete
es: Borrar
fr: Supprimer

source: No saved wraps found.
es: No se encontraron wraps guardados.
fr: Aucun wrap enregistré n'a été trouvé.

source: Saved DuoWraps
es: DuoWraps guardados
fr: DuoWraps enregistrés

source: and
es: y
fr: et

source: 6 Month DuoWrap
es: DuoWrap de 6 meses
fr: DuoWrap 6 mois

source: Profile Picture
es: Foto de perfil
fr: Photo de profil

source: Log out
es: Cerrar sesión
fr: Se déconnecter

source: Name
es: Nombre
fr: Nom

source: Email
es: Dirección de correo electrónico
fr: Adresse email

source: Username
es: Nombre de usuario
fr: Nom d'utilisateur

source: Are you sure you want to delete your account?
es: ¿Estás seguro de que quieres eliminar tu cuenta?
fr: Etes-vous sûr de vouloir supprimer votre compte ?

source: Delete Account
es: Eliminar cuenta
fr: Supprimer le compte

source: Contact the Developers
es: Contacta con los desarrolladores
fr: Contacter les développeurs

source: Developer's Page
es: Página del desarrollador
fr: Page du développeur

source: Meet Our Team
es: Conozca a nuestro equipo
fr: Rencontrez notre équipe

source: Scrum Master
es: Maestra de scrum
fr: Maître Scrum

source: Front-end Developer
es: Desarrolladora front-end
fr: Développeur front-end

source: As Scrum Master, Pranati ensured the team’s workflow ran smoothly, addressing any obstacles and keeping the project on track during sprints.
es: Como Scrum Master, Pranati se aseguró de que el flujo de trabajo del equipo se desarrollara sin problemas, abordando cualquier obstáculo y manteniendo el proyecto encaminado durante los sprints.
fr: En tant que Scrum Master, Pranati a veillé au bon déroulement du flux de travail de l'équipe, en surmontant tous les obstacles et en maintenant le projet sur la bonne voie pendant les sprints.

source: Pranati helped Denise Wall create Figma wireframes for the website’s layout. She was also involved in getting the basic layouts translated into Webflow, which allowed the team to build and refine the website's front-end with ease visually.
es: Pranati ayudó a Denise Wall a crear esquemas de Figma para el diseño del sitio web. También participó en la traducción de los diseños básicos a Webflow, lo que permitió al equipo crear y perfeccionar visualmente la interfaz del sitio web con facilidad.

source: Product Manager
es: Gerente de Producto
fr: Chef de produit

source: Full Stack Developer
es: Desarrolladora de pila completa
fr: Développeur Full Stack

source: Project Management
es: Gestión de proyectos
fr: Gestion de projet

source: As the Product Owner, Katherine was responsible for prioritizing user stories, coordinating sprint planning, and making sure the team stayed aligned with project goals.
es: Como propietaria del producto, Katherine era responsable de priorizar las historias de los usuarios, coordinar la planificación del sprint y asegurarse de que el equipo se mantuviera alineado con los objetivos del proyecto.
fr: En tant que Product Owner, Katherine était chargée de prioriser les user stories, de coordonner la planification du sprint et de s'assurer que l'équipe restait alignée sur les objectifs du projet.

source: Full-Stack Development
es: Desarrollo completo
fr: Développement Full-Stack

source: Katherine played a crucial role in bridging front-end and back-end development, ensuring smooth integration and consistency. She addressed inconsistencies in UI layout when dynamic data was displayed.
es: Katherine desempeñó un papel crucial a la hora de unir el desarrollo de front-end y back-end, garantizando una integración y coherencia fluidas. Abordó las inconsistencias en el diseño de la interfaz de usuario cuando se mostraban datos dinámicos.
fr: Katherine a joué un rôle crucial en reliant le développement front-end et back-end, garantissant une intégration et une cohérence fluides. Elle a corrigé les incohérences dans la disposition de l'interface utilisateur lors de l'affichage des données dynamiques.

source: Back-end Developer
es: Desarrollador back-end
fr: Développeur back-end

source: API Integration
es: Integración API
fr: Intégration d'API

source: Samrita worked extensively with the Spotify API to retrieve users’ listening data, generate personalized wrapped statistics, and calculate compatibility. She also added multi-language support for the site.
es: Samrita trabajó extensamente con la API de Spotify para recuperar los datos de escucha de los usuarios, generar estadísticas empaquetadas personalizadas y calcular la compatibilidad. También agregó soporte en varios idiomas para el sitio.
fr: Samrita a beaucoup travaillé avec l'API Spotify pour récupérer les données d'écoute des utilisateurs, générer des statistiques personnalisées et calculer la compatibilité. Elle a également ajouté un support multilingue pour le site.

source: Database Management
es: Base de datos de mangamento
fr: Gestion de base de données

source: Samrita contributed to the backend database setup, ensuring that user-generated data, such as Spotify Wrapped results, was correctly stored and retrieved when needed for account management and details.
es: Samrita contribuyó a la configuración de la base de datos backend, asegurando que los datos generados por el usuario, como los resultados de Spotify Wrapped, se almacenaran y recuperaran correctamente cuando fuera necesario para la administración y los detalles de la cuenta.
fr: Samrita a contribué à la configuration de la base de données principale, garantissant que les données générées par les utilisateurs, telles que les résultats Spotify Wrapped, étaient correctement stockées et récupérées lorsque cela était nécessaire pour la gestion et les détails du compte.

source: User Interface Design
es: Diseño de interfaz de usuario
fr: Conception de l'interface utilisateur

source: Denise worked alongside Pranati Duvvuri to design and refine the user interface. She utilized Figma to create low-fidelity and high-fidelity wireframes, finalizing key design elements and interactive features.
es: Denise trabajó junto a Pranati Duvvuri para diseñar y perfeccionar la interfaz de usuario. Utilizó Figma para crear estructuras alámbricas de alta y baja fidelidad, finalizando elementos de diseño clave y funciones interactivas.
fr: Denise a travaillé aux côtés de Pranati Duvvuri pour concevoir et affiner l'interface utilisateur. Elle a utilisé Figma pour créer des wireframes basse et haute fidélité, finalisant les éléments de conception clés et les fonctionnalités interactives.

source: Mood Board & Chrome Theme
es: Panel de estado de ánimo y tema de Chrome
fr: Tableau d'humeur et thème Chrome

source: Denise made several mood boards for the website layout to help the team hone down on a visual direction and style of the site. She also played a key role in figuring out the Chrome theme for the website, ensuring it was consistent with the overall branding and aesthetic.
es: Denise creó varios paneles de estado de ánimo para el diseño del sitio web para ayudar al equipo a definir la dirección visual y el estilo del sitio. También desempeñó un papel clave en la definición del tema de Chrome para el sitio web, asegurándose de que fuera coherente con la marca general. y estético.
fr: Denise a réalisé plusieurs tableaux d'ambiance pour la mise en page du site Web afin d'aider l'équipe à affiner l'orientation visuelle et le style du site. Elle a également joué un rôle clé dans la définition du thème Chrome du site Web, en s'assurant qu'il était cohérent avec l'image de marque et l'esthétique globale.

source: Maddie worked closely with Samrita Shetty and Katherine Sanders to integrate the Spotify API to retrieve user listening data and power the personalized wrapped statistics.
es: Maddie trabajó en estrecha colaboración con Samrita Shetty y Katherine Sanders para integrar la API de Spotify para recuperar datos de escucha de los usuarios y potenciar las estadísticas empaquetadas personalizadas.
fr: Maddie a travaillé en étroite collaboration avec Samrita Shetty et Katherine Sanders pour intégrer l'API Spotify afin de récupérer les données d'écoute des utilisateurs et d'alimenter les statistiques personnalisées.

source: Collaboration with Full-Stack
es: Colaboración con pila completa
fr: Collaboration avec le Full-Stack

source: Maddie worked alongside Katherine Sanders to ensure that the backend could support the dynamic features required by the front-end team, helping both the front-end and full-stack developers to integrate functionality such as user authentication and wrapped data display.
es: Maddie trabajó junto a Katherine Sanders para garantizar que el backend pudiera admitir las funciones dinámicas requeridas por el equipo de front-end, ayudando tanto a los desarrolladores de front-end como a los de pila completa a integrar funciones como la autenticación de usuarios y la visualización de datos empaquetados.
fr: Maddie a travaillé aux côtés de Katherine Sanders pour s'assurer que le backend pouvait prendre en charge les fonctionnalités dynamiques requises par l'équipe front-end, aidant ainsi les développeurs front-end et full-stack à intégrer des fonctionnalités telles que l'authentification des utilisateurs et l'affichage des données enveloppées.

source: Loading…
es: Cargando...
fr: Chargement...

source: Link to Spotify Error
es: Error en el enlace a Spotify
fr: Erreur de lien vers Spotify

source: Failed to Authenticate
es: Error al autenticarse
fr: Échec de l'authentification

source: Try Again
es: Intentar otra vez
fr: Essayer à nouveau

source: Login
es: Acceso
fr: Se connecter

source: Get your Spotify Wrapped.
es: Obtenga su Spotify Wrapped.
fr: Obtenez votre Spotify Wrapped.

source: Email Address
es: Dirección de correo electrónico
fr: Adresse email

source: Password
es: Contraseña
fr: Mot de passe

source: Sign In
es: Iniciar sesión
fr: Se connecter

source: Don’t have an account? Register here!
es: ¿No tienes una cuenta? Regístrate aquí!
fr: Vous n'avez pas de compte ? Inscrivez-vous ici !

source: Link to Spotify
es: Enlace a Spotify
fr: Lien vers Spotify

source: Click here to Link
es: Haga clic aquí para vincular
fr: Cliquez ici pour créer un lien

source: Register
es: Registro
fr: Registre

source: Sign Up
es: Inscribirse
fr: S'inscrire

source: First Name
es: Nombre de pila
fr: Prénom

source: Last Name
es: Apellido
fr: Nom de famille

source: Confirm Password
es: Confirmar contraseña
fr: Confirmez le mot de passe

source: This is your Wrapped for the past month.
es: Este es tu Wrapped del último mes.
fr: C'est votre Wrapped du mois dernier.

source: This is your Wrapped for the past 6 months.
es: Este es tu Wrapped de los últimos 6 meses.
fr: C'est votre Wrapped des 6 derniers mois.

source: This is your Wrapped for the past year.
es: Este es tu Wrapped del año pasado.
fr: C'est votre Wrapped de l'année passée.

source: your mix has <br>LOVELY<br>vibes
es: tu mezcla tiene unas vibraciones <br>HERMOSAS<br>
fr: votre mix a de <br>JOLIES<br>vibes

source: TOP
es: MEJORES

source: TRACKS
es: CANCIONES
fr: CHANSONS

source: Your Top Track
es: Canción favorita
fr: Chanson préférée

source: ARTISTS
es: ARTISTAS
fr: MUSICIENS

source: Your Top Artist
es: Tu músico estrella
fr: Meilleur musicien

source: FAVORITE
es: GÉNEROS
fr: GENRES

source: GENRES
es: FAVORITOS
fr: PRÉFÉRÉS

source: Your Favorite Genres
es: Tus géneros favoritos
fr: Vos genres préférés

source: Last 6 Months
es: Últimos 6 meses
fr: Les 6 derniers mois

source: You two are from different planets
es: Ustedes dos son de planetas diferentes.
fr: Vous venez tous les deux de planètes différentes

source: You two might have similar tastes in music
es: Puede que ambos tengan gustos musicales similares.
fr: Vous avez peut-être des goûts musicaux similaires

source: You two might just be the same person
es: Ustedes dos podrían ser la misma persona
fr: Vous deux pourriez être la même personne

source: LOVELY<br>vibes
es: HERMOSAS<br>vibras
fr: Ambiance<br>CHARMANTE

source: COOL<br>vibes
es: BUENAS<br>vibras
fr: Ambiance<br>COOL

source: DUO
es: DÚO

source: PLAYLIST
es: LISTA DE REPRODUCCIÓN
fr: LISTE DE LECTURE

source: Duo Playlist
es: Lista de dúos
fr: Liste des duos

source: DuoWrapped Invite
es: Invitación DuoWrapped
fr: Invitation DuoWrapped

source: Click here to link your friend’s Spotify!
es: ¡Haz clic aquí para vincular el Spotify de tu amigo!
fr: Cliquez ici pour lier le Spotify de votre ami!

source: Link Spotify
es: Enlace Spotify
fr: Lier Spotify

source: Invite your friends to measure your compatibility from tracks, artists, and genres from DuoWrapped!
es: ¡Invita a tus amigos a medir tu compatibilidad con pistas, artistas y géneros de DuoWrapped!
fr: Invitez vos amis à mesurer votre compatibilité à partir des morceaux, des artistes et des genres de DuoWrapped!

source: Welcome
es: Bienvenido
fr: Bienvenu

source: see your Wrapped from
es: ver tu Wrapped desde de
fr: vois ton Wrapped de

source: [Select]
es: [Seleccionar]
fr: [Sélectionner]

source: Last Month
es: El ultimo mes
fr: Mois dernier

source: The Last 6 Months
es: Los últimos 6 meses
fr: 6 derniers mois

source: Last Year
es: El año pasado
fr: L'année dernière
